# Cadence Genus(TM) Synthesis Solution, Version 18.10-p003_1, built Jun  7 2018 23:53:27

# Date: Wed Oct 21 15:26:23 2020
# Host: tiuelabb4.ti.lab (x86_64 w/Linux 3.10.0-1127.19.1.el7.x86_64) (4cores*4cpus*1physical cpu*Intel(R) Core(TM) i5-6500 CPU @ 3.20GHz 6144KB)
# OS:   CentOS Linux release 7.8.2003 (Core)

set_db init_lib_search_path /eda/pdk/FreePDK45/osu_soc/lib/files/
set_db script_search_path ~/Desktop/CAD/Cadence2/Counter_10/scripts/
set_db init_hdl_search ~/Desktop/CAD/Cadence2/Counter_10/rtl/
set_db init_hdl_search_path ~/Desktop/CAD/Cadence2/Counter_10/rtl/
set_db library gscl45nm.lib
set_db hdl_vhdl_read_version 2008
read_hdl -language vhdl {
adder4_behavorial.vhd,
Counter_Control_behave.vhd,
reg_4bit_behavorial.vhd,         
comparator_10_datatflow.vhd,     
counterdatapath_behavorial.vhd,  
topLevel_behavior.vhd  
}
set_db hdl_vhdl_read_version 1993
set_db hdl_vhdl_read_version 1993
set_db hdl_vhdl_read_version 2008
set_db init_hdl_search_path ~/Desktop/CAD/Cadence2/Counter_10/rtl/
read_hdl adder4_behavorial.vhd
read_hdl -languaage vhdl adder4_behavorial.vhd
clear
read_hdl -languaage vhdl adder4_behavorial.vhd
clear
read_hdl -languaage vhdl adder4_behavorial.vhd
read_hdl -language vhdl adder4_behavorial.vhd
read_hdl -language vhdl adder4_behavorial.vhd
read_hdl -language vhdl Counter_Control_behave.vhd
read_hdl -language vhdl reg_4bit_behavorial.vhd
read_hdl -language vhdl comparator_10_datatflow.vhd
read_hdl -language vhdl counterdatapath_behavorial.vhd
read_hdl -language vhdl topLevel_behavior.vhd
elaborate topLevel
gui_show
set_db hdl_track_filename_row_col true
elaborate topLevel
set_db hdl_track_filename_row_col true
read_hdl adder4_behavorial.vhd
read_hdl -languaage vhdl adder4_behavorial.vhd
read_hdl -language vhdl  {adder4_behavorial.vhd Counter_Control_behave.vhd reg_4bit_behavorial.vhd comparator_10_datatflow.vhd  counterdatapath_behavorial.vhd topLevel_behavior.vhd }
set_db hdl_vhdl_read_version 2008
read_hdl -language vhdl  {adder4_behavorial.vhd Counter_Control_behave.vhd reg_4bit_behavorial.vhd comparator_10_datatflow.vhd  counterdatapath_behavorial.vhd topLevel_behavior.vhd }
elaborate topLevel
gui-show
gui-show
gui_show
gui-sjow
gui_show
